import React from 'react';

// 부트스트랩 관련
import 'bootstrap/dist/css/bootstrap.css'
import { Container } from 'react-bootstrap';
import { Form } from 'react-bootstrap';
import { Col } from 'react-bootstrap';
import { Row } from 'react-bootstrap';
import { Button } from 'react-bootstrap';
import { Nav } from 'react-bootstrap';

// css관련
import "./common.css";
import "./main.css";

function Main() {

    return (
            <Container>
                {/* header */}
                <Row>
                    <Nav defaultActiveKey="/home" as="ul">
                    <Nav.Item as="li">
                    <Nav.Link href="/home">
                        <div className="todaycloud-logo">
                            <svg width="182" height="98" viewBox="0 0 182 98" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M167.247 52.9717C177.318 66.9934 183.484 94.8957 127.574 94.3317C72.2951 107.68 67.2331 81.4067 71.612 66.6017C62.9418 73.1817 38.6127 80.5137 10.6578 57.2017C0.710418 51.3267 -16.141 22.4218 36.6684 22.4218C69.0372 -18.1862 98.3232 5.50177 108.92 22.4218C112.686 13.6786 129.624 -1.19378 167.247 9.26177C192.469 19.6018 180.471 48.5067 167.247 52.9717Z" fill="url(#paint0_linear_167_12)" fill-opacity="0.5"/>
                            <defs>
                            <linearGradient id="paint0_linear_167_12" x1="42.5628" y1="10.81" x2="154.548" y2="57.0117" gradientUnits="userSpaceOnUse">
                            <stop offset="0.135417" stop-color="#6567E8"/>
                            <stop offset="0.776042" stop-color="#7791D1" stop-opacity="0.8"/>
                            <stop offset="0.958333" stop-color="#7791D1" stop-opacity="0.8"/>
                            </linearGradient>
                            </defs>
                            </svg>
                        </div>
                    </Nav.Link>
                    </Nav.Item>
                    <div className="header-menu">
                    <Nav.Item as="li">
                    <Nav.Link eventKey="link-1">오늘의 구름소개</Nav.Link>
                    </Nav.Item>
                    <Nav.Item as="li">
                    <Nav.Link eventKey="link-2">로그인</Nav.Link>
                    </Nav.Item>
                    <Nav.Item as="li">
                    <Nav.Link eventKey="link-3">회원가입</Nav.Link>
                    </Nav.Item>
                    </div>
                    </Nav>
                </Row>

                {/* sidebar */}
                <Row>
                    <Col sm={2} className="main-sidebar">
                        <div className="weekly_tags">
                            <div>Weekly Tags</div>
                            <ul>
                                <li>#전체</li>
                                <li>#안목해변</li>
                                <li>#제주도</li>
                                <li>#익선동</li>
                                <li>#인천공항</li>
                                <li>#강남사거리</li>
                                <li>#오사카</li>
                            </ul>
                        </div>
                    </Col>

                    {/* main content */}
                    <Col sm={10} className="main-contents">
                        {/* today's cloud input */}
                        <Row>
                            <div className="whats-today">
                                <div className="cloud-svg">
                                    <svg width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <g clip-path="url(#clip0_84_351)">
                                    <path opacity="0.8" fill-rule="evenodd" clip-rule="evenodd" d="M25.35 7.8H23.4C21.6707 7.80023 19.9903 8.37491 18.623 9.43377C17.2556 10.4926 16.2787 11.9757 15.8457 13.65H15.6C13.5314 13.65 11.5474 14.4718 10.0846 15.9346C8.62183 17.3974 7.80005 19.3813 7.80005 21.45C7.80005 23.5187 8.62183 25.5027 10.0846 26.9654C11.5474 28.4282 13.5314 29.25 15.6 29.25H31.2C33.118 29.2528 34.9697 28.5489 36.4014 27.2727C37.8331 25.9966 38.7445 24.2377 38.9614 22.332C39.1783 20.4264 38.6854 18.5077 37.5771 16.9425C36.4688 15.3772 34.8226 14.2752 32.9531 13.847C32.5559 12.128 31.588 10.5944 30.2072 9.4962C28.8264 8.39802 27.1143 7.80012 25.35 7.8Z" fill="#50B8E7"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M19.5 5.85001H17.55C15.8206 5.85024 14.1403 6.42491 12.7729 7.48377C11.4056 8.54263 10.4287 10.0257 9.99571 11.7H9.75001C7.68132 11.7 5.69736 12.5218 4.23458 13.9846C2.7718 15.4474 1.95001 17.4313 1.95001 19.5C1.95001 21.5687 2.7718 23.5527 4.23458 25.0154C5.69736 26.4782 7.68132 27.3 9.75001 27.3H25.35C27.2679 27.3028 29.1196 26.5989 30.5514 25.3227C31.9831 24.0466 32.8945 22.2877 33.1113 20.3821C33.3282 18.4764 32.8354 16.5577 31.7271 14.9925C30.6187 13.4272 28.9726 12.3252 27.1031 11.897C26.7059 10.178 25.7379 8.64438 24.3572 7.5462C22.9764 6.44803 21.2642 5.85012 19.5 5.85001ZM11.507 13.65L11.8833 12.1875C12.2083 10.9317 12.9411 9.81937 13.9668 9.02524C14.9924 8.2311 16.2528 7.80013 17.55 7.80001H19.5C22.2398 7.80001 24.5973 9.70126 25.2018 12.3338L25.4748 13.5233L26.6643 13.7982C28.0626 14.1234 29.2925 14.9511 30.1202 16.1241C30.9479 17.297 31.3155 18.7332 31.1533 20.1596C30.991 21.586 30.3101 22.9029 29.2401 23.8599C28.17 24.8169 26.7856 25.3473 25.35 25.35H9.75001C8.1985 25.35 6.71053 24.7337 5.61344 23.6366C4.51635 22.5395 3.90001 21.0515 3.90001 19.5C3.90001 17.9485 4.51635 16.4605 5.61344 15.3634C6.71053 14.2663 8.1985 13.65 9.75001 13.65H11.507Z" fill="black"/>
                                    <path d="M17.55 19.5C17.55 19.2414 17.6528 18.9934 17.8356 18.8106C18.0185 18.6277 18.2665 18.525 18.525 18.525C18.7836 18.525 19.0316 18.6277 19.2145 18.8106C19.3973 18.9934 19.5 19.2414 19.5 19.5V34.125C19.5 34.3836 19.3973 34.6316 19.2145 34.8144C19.0316 34.9973 18.7836 35.1 18.525 35.1C18.2665 35.1 18.0185 34.9973 17.8356 34.8144C17.6528 34.6316 17.55 34.3836 17.55 34.125V19.5Z" fill="black"/>
                                    <path d="M22.7917 29.4645C22.9946 29.3173 23.2463 29.2539 23.4947 29.2875C23.7431 29.321 23.969 29.4489 24.1256 29.6446C24.2821 29.8403 24.3573 30.0888 24.3355 30.3385C24.3137 30.5882 24.1966 30.8199 24.0085 30.9855L19.1335 34.8855C19.0345 34.9727 18.9189 35.0388 18.7935 35.08C18.6682 35.1212 18.5358 35.1365 18.4044 35.125C18.273 35.1136 18.1453 35.0755 18.029 35.0133C17.9127 34.951 17.8103 34.8658 17.7279 34.7628C17.6455 34.6598 17.5848 34.5411 17.5496 34.414C17.5144 34.2869 17.5053 34.154 17.523 34.0232C17.5406 33.8925 17.5846 33.7667 17.6523 33.6535C17.72 33.5403 17.8099 33.442 17.9167 33.3645L22.7917 29.4645Z" fill="black"/>
                                    <path d="M13.0415 30.9855C12.8533 30.8199 12.7362 30.5882 12.7145 30.3385C12.6927 30.0888 12.7678 29.8403 12.9244 29.6446C13.081 29.4489 13.3069 29.321 13.5553 29.2875C13.8036 29.2539 14.0554 29.3173 14.2583 29.4645L19.1333 33.3645C19.3214 33.5301 19.4385 33.7618 19.4603 34.0115C19.482 34.2612 19.4069 34.5096 19.2503 34.7054C19.0937 34.9011 18.8678 35.029 18.6194 35.0625C18.3711 35.096 18.1193 35.0327 17.9165 34.8855L13.0415 30.9855Z" fill="black"/>
                                    </g>
                                    <defs>
                                    <clipPath id="clip0_84_351">
                                    <rect width="39" height="39" fill="white"/>
                                    </clipPath>
                                    </defs>
                                    </svg>
                                </div> 
                                <div className="today-whats">
                                    <p>당신의 오늘의 구름을 이야기 해주세요 :-)</p>
                                <div className="cloud-put">
                                    <svg width="21" height="23" viewBox="0 0 21 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M4.59667 13.8414C4.32483 14.559 4.095 15.2214 3.88967 15.8918C5.00967 15.0903 6.34083 14.582 7.87733 14.3923C10.8092 14.0312 13.4143 12.1233 14.7327 9.72555L13.034 8.0523L14.6825 6.42505L15.8492 5.2739C16.3508 4.7794 16.9167 3.8663 17.5152 2.5507C10.99 3.54775 6.99417 7.4865 4.5955 13.8414H4.59667ZM16.3333 8.05115L17.5 9.2C16.3333 12.65 12.8333 16.1 8.16667 16.675C5.05283 17.0591 3.108 19.167 2.331 23H0C1.16667 16.1 3.5 0 21 0C19.8333 3.44655 18.669 5.7454 17.5035 6.89655L16.3333 8.05115Z" fill="#4E4A4A"/>
                                    </svg>
                                </div>
                                </div>
                            </div>
                        </Row>
                            <div className="today-news">
                                <div className="today-profile">
                                    <div className="user-profile"></div>
                                </div>
                                <div className="news-cloud">
                                    <div>가나다라마바사아자차</div>
                                </div>
                                <div className="today-tags">
                                    <ul>
                                        <li>#문래동</li>
                                        <li>#비빔국수</li>
                                        <li>#맛집</li>
                                    </ul>
                                </div>
                            </div>

                            <div className="today-news">
                                <div className="today-profile">
                                    <div className="user-profile"></div>
                                </div>
                                <div className="news-cloud">
                                    <div>가나다라마바사아자차</div>
                                </div>
                                <div className="today-tags">
                                    <ul>
                                        <li>#문래동</li>
                                        <li>#비빔국수</li>
                                        <li>#맛집</li>
                                    </ul>
                                </div>
                            </div>
                    </Col>
                </Row>
            </Container>
    );
}

export default Main;